Tekla Open API Reference for Tekla Structures 2025
ComponentFilterExpressions Class
 The ComponentFilterExpressions class contains all the component filter expressions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class ComponentFilterExpressions
Public NotInheritable Class ComponentFilterExpressions
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace